<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f1d6a9fdb5138adfba1508e238662234322f10279b5ef29d86ed3988840e3c86","plan_job_ref":"Job Run Terraform plan in staging #110 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505926519","plan_out_hash":"51a5b7ec793dc2db8c8fff93dc709df1ab70b677910aedc2e3810082eea7c93a","plan_hash":"6cda4b3b5f908ccde715dffa06b9f2d545fdeec8d79deac02f3b168ab0951cca","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T15:58:48Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      source_code_hash            = "gKlUi9o+h4iokClxdzrjXmkEtyVv85wAb0IcJ+HfRws=" -> "o7eSsQ6KYvpusIszZViqMh2gT2pCp9PA283FuNHewnw="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2024-12-26T16:00:57Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "68083ad3-a0ae-5d8c-a25c-c4cfa59942b6"

-       policy {
-           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "699701cc-75f1-4308-a9d8-476b6ea0ca03" -> null
        }
-       policy {
-           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "699701cc-75f1-4308-a9d8-476b6ea0ca03" -> null
        }
+       policy {
+           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "8c507bc9-50fe-4247-88f6-b69f964f9c8c"
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #110](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/12505926519)